runTestCases/initialCases/4.2_NACA0012_AOA0/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
414.63042
272.66895
414.47595
184.25476
271.44502
414.44269
134.9997
178.59141
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
414.7782
273.91768
189.54101
145.7837
124.80649
113.56276
105.83497
99.12946
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
501.00001
501.00001
501.00001
501.00001
501.00001
501.00001
501.00001
501.00001
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
0.99546207
0.98492263
0.97103899
0.95289877
0.92944811
0.89954577
0.86207601
0.81613389
...
)
;
    }
}


// ************************************************************************* //
