runTestCases/initialCases/4.2_NACA0012_AOA0/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3584
(
-389.23981
-389.32026
-224.67676
-388.43747
-224.79539
-129.69836
-389.38639
-224.91016
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
-493.68064
-494.68701
-497.3828
-500.67518
-502.91394
-504.17717
-504.98975
-505.62123
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
389.18513
224.6385
129.6768
74.862686
43.219724
24.952023
14.405665
8.3169257
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
-0.00064011804
-0.0021158679
-0.0040302139
-0.0064822314
-0.0095725501
-0.013388858
-0.017984127
-0.023348379
...
)
;
    }
}


// ************************************************************************* //
