runTestCases/initialCases/4.2_NACA0012_AOA0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    // defult
    default         Gauss linear;

    // default cellLimited Gauss linear 0.5;
    // grad(U) faceLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;
    div(U)          Gauss linear;

    // even more accurate but oscillatory scheme if without "bounded"
    div(phi,U)      bounded Gauss linearUpwind grad(U);


    //div(phi,k)      bounded Gauss limitedLinear 1;
    //div(phi,omega)  bounded Gauss limitedLinear 1;

    div(phi,k)      Gauss upwind;
    div(phi,omega)  Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(nonlinearStress)  Gauss linear;

    // accurate and stable 
    // div(phi,U)      Gauss linearUpwind grad(U);
    // div(phi,omega)  Gauss linearUpwind grad(omega);
    // div(phi,k)      Gauss linearUpwind grad(k);
    // div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    // very good quality mesh with uniform cell size
    // default Gauss linear orthogonal;

    // default         Gauss linear limited 1;

    default         Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    // default         limited 1;

    default         corrected;
}

wallDist
{
    method meshWave;
    correctWalls    true;
}


// ************************************************************************* //
